{ "_meta": { "sources": [{ "json": "MPSource", "abbreviation": "MPSource", "full": "Test Auto Souce - Beyonders", "authors": ["Me"], "version": "1.0.0", "url": "https://www.youtube.com/watch?v=dQw4w9WgXcQ&ab_channel=RickAstley", "color": "c2b280" }], "dateAdded": 1620498967, "dateLastModified": 1620498967, "tested": true }, "monster": [{ "name": "Veldarin, Archmage of Alyentlea", "type": { "type": "Celestial", "tags": ["night elf"] }, "alignment": ["c", "e"], "size": "M", "cha": "27", "wis": "29", "int": "30", "con": "30", "str": "25", "dex": "21", "hp": { "formula": "30d6 + 300", "average": 422 }, "ac": [{ "ac": 23, "from": ["natural armor"] }], "speed": { "walk": 40, "fly": 80 }, "cr": "30", "save": { "dex": "+14", "con": "+19", "int": "+19", "wis": "+18" }, "skill": { "arcana": "+19", "history": "+19", "insight": "+18", "investigation": "+19", "perception": "+18", "religion": "+19" }, "passive": 37, "immune": ["bludgeoning, piercing, and slashing from nonmagical attacks"], "resist": ["bludgeoning", "necrotic", "piercing", "radiant", "slashing"], "conditionImmune": ["blinded", "charmed", "exhaustion", "frightened", "stunned"], "languages": ["All"], "senses": ["darkvision 240ft.", "truesight 120ft."], "trait": [{ "name": "Magic Weapons", "entries": ["Veldarin's weapon attacks are magical."] }, { "name": "Limited Magic Immunity", "entries": ["Unless he wishes to be affected, Veldarin is immune to spells of 4th level or lower. He has advantage on saving throws against all other spells and magical effects."] }, { "name": "Regeneration", "entries": ["If Veldarin has at least 1 hit point, he regains 20 hit points at the start of his turn."] }, { "name": "Arch-Caster", "entries": ["Veldarin has advantage on Constitution saving throws made to maintain your concentration on a spell. Veldarin does not have to make Concentration checks unless they receive more than {@b 40} hit points of damage."] }, { "name": "Aura of Undiscernability", "entries": ["While Veldarin is wielding the {@i {@b Shadow Gauntlets}}, a creature that starts it's turn within 20 feet of Veldarin must succeed on a {@dc 27} Wisdom saving throw, unless Veldarin is {@condition incapacitated}. On a failed save, the creature is forced to question the metaphysical nature of Veldarin until the start of its next turn. Until this ends, the target can't take actions or reactions, and its speed is 0 and can't be increased. If a creature's saving throw is successful, the creature is immune to Veldarin's {@i Aura of Undiscernability} for the next 24 hours."] }, { "name": "Discorporation", "entries": ["when Veldarin drops to 0 hit points or dies, his body is destroyed but his essence travels back to his domain the Feywild, and is unable to take physical form for a time."] }, { "name": "Improved Minor Illusion", "entries": ["{@i Minor illusion} cast by Veldarin can create both a sound and an image with a single casting of the spell."] }, { "name": "Illusory Reality", "entries": ["When Veldarin casts an illusion spell of 1st level or higher, one inanimate, nonmagical object that is part of the illusion can be made real. This can be done as a bonus action while the spell is ongoing. It lasts for 1 minute and can not deal damage or otherwise directly harm anyone."] }, { "name": "Illusory Aspects", "entries": ["Veldarin's thoughts cannot be read and they cannot be affected by divination spells."] }, { "name": "Convincing Illusions", "entries": ["Illusion spells cast by Veldarin that would fail physical inspection, can now pass as real."] }, { "name": "Illusionist’s Cunning", "entries": ["Illusion spells cast by the Archmage of Alyentlea gains all effects as if it was cast with a spell slot one level higher, up to a maximum of 9th level."] }, { "name": "Illusory Trickery (Recharges after a Short or Long Rest)", "entries": ["The Archmage of Alyentlea is permanently affected by {@i nystul’s magic aura}, gaining both its effects. As a bonus action, they can invoke an illusory duplicate of yourself as if you had cast the {@i mirror image} spell."] }, { "name": "Deep Memory (2/Long Rest)", "entries": ["Veldarin can exchange one memorized spell for any other spell as a bonus action."] }, { "name": "Prismatic Juggle", "entries": ["When Veldarin casts a spell with a spell slot, that isn’t of the same school as the previous spell you cast, within a minute of the last casting, the new spell is cast as if it is one level higher."] }, { "name": "Archmage", "entries": ["Veldarin uses a meta physical spellbook that only they can open and read. They can conjure the book as a bonus action. The book contains all wizard spells and has an infinite number of pages."] }, { "name": "Swift Caster", "entries": ["While wielding the {@b {@i Shadow Gauntlets}}, Veldarin can use a bonus action to cast a spell that has a casting time of one action."] }], "spellcasting": [{ "name": "Innate Spellcasting", "headerEntries": ["Veldarin's innate spellcasting ability is Charisma (spell save {@dc 25}, {@hit 17} to hit with spell attacks). He can innately cast the following spells, requiring no material components:"], "ability": "cha", "will": ["{@spell dancing lights}", "{@spell detect magic}"], "daily": { "1e": ["{@spell darkness}", "{@spell dispel magic}", "{@spell faerie fire}", "{@spell levitate}"] } }, { "name": "Spell Mastery", "headerEntries": ["Veldarin's innate spellcasting ability is Intelligence (spell save {@dc 27}, {@hit 19} to hit with spell attacks). It can innately cast the following spells, requiring no material components:"], "ability": "int", "will": ["{@spell blur} (without concentration)", "{@spell disguise self}"], "daily": { "1e": ["{@spell hypnotic pattern}", "{@spell summon fey|TCE}"] } }, { "name": "Ritual Casting", "headerEntries": ["Veldarin's innate spellcasting ability is Intelligence (spell save {@dc 27}, {@hit 19} to hit with spell attacks). It can innately cast the following spells at will, taking 10 minutes longer to cast than normal:"], "ability": "int", "will": ["{@spell comprehend languages}", "{@spell find familiar}", "{@spell identify}", "{@spell leomund's tiny hut}", "{@spell rary's telepathic bond}", "{@spell unseen servant}"] }, { "name": "Spellcasting", "spells": { "0": { "spells": ["{@spell chill touch}", "{@spell fire bolt}", "{@spell lightning lure|TCE}", "{@spell mage hand}", "{@spell message}", "{@spell minor illusion}", "{@spell prestidigitation}", "{@spell toll the dead|XGE}"] }, "1": { "spells": ["{@spell chromatic orb}", "{@spell color spray}*", "{@spell disguise self}", "{@spell shield}", "{@spell silent image}"], "slots": 4 }, "2": { "spells": ["{@spell blur}", "{@spell invisibility}*", "{@spell mirror image}", "{@spell misty step}", "{@spell scorching ray}"], "slots": 4 }, "3": { "spells": ["{@spell counterspell}", "{@spell dispel magic}", "{@spell fireball}", "{@spell haste}", "{@spell hypnotic pattern}", "{@spell major image}", "{@spell summon fey|TCE}"], "slots": 3 }, "4": { "spells": ["{@spell dimension door}", "{@spell greater invisibility}", "{@spell phantasmal killer}*", "{@spell polymorph}"], "slots": 3 }, "5": { "spells": ["{@spell bigby's hand}", "{@spell mislead}", "{@spell modify memory}", "{@spell scrying}"], "slots": 3 }, "6": { "spells": ["{@spell disintegrate}", "{@spell globe of invulnerability}", "{@spell mental prison|XGE}", "{@spell tasha's otherworldly guise|TCE}"], "slots": 2 }, "7": { "spells": ["{@spell mirage arcane}", "{@spell prismatic spray}", "{@spell reverse gravity}"], "slots": 2 }, "8": { "spells": ["{@spell feeblemind}", "{@spell illusory dragon|XGE}", "{@spell maddening darkness|XGE}"], "slots": 2 }, "9": { "spells": ["{@spell psychic scream|XGE}", "{@spell weird}"], "slots": 2 } }, "headerEntries": ["Veldarin is an 30th-level spellcaster. Their spellcasting ability is Intelligence (spell save {@dc 27}, {@hit 19} to hit with spell attacks). Veldarin has the following wizard spells prepared:"], "footerEntries": ["10th (1 slot)", "11th (1 slot)", "12th (1 slot)", "*illusion spell of first level or higher"] }], "spellcastingTags": ["I", "", "", "CW"], "action": [{ "name": "Multiattack", "entries": ["Veldarin attacks twice with his {@b {@i Shadow Gauntlets}} and uses his {@b {@i Mental Stunting}}."] }, { "name": "Shadow Gauntlets", "entries": ["{@atk mw} {@hit 16} to hit, reach 5 ft., one target. {@h}29 ({@damage 5d8 + 7}) psychic damage. On a hit, the target must succeed on a {@dc 27} Wisdom saving throw. On a failed save, the creature is forced to question the metaphysical nature of Veldarin until the start of its next turn."] }, { "name": "Spatially Unbound", "entries": ["Veldarin magically teleports, along with any equipment it is wearing and carrying, up to 120 feet to an unoccupied space they can see."] }, { "name": "Malleable Illusions", "entries": ["Veldarin changes the nature of illusion spells with a duration of 1 minute or longer, (using the spell's normal parameters for the illusion), if they can see the illusion."] }, { "name": "Mental Stunting", "entries": ["Veldarin uses illusions to physically overwhelm one creature he can see within 120 feet of it. The target must succeed on a {@dc 24} Constitution saving throw. On a failed save, the creature takes 31 ({@damage 6d6 + 10}) cold damage, can't use reactions, its speed is halved, and it can't make more than one attack on its turn. In addition, the creature can use either an action or a bonus action on its turn, but not both. These effects last for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself with a successful save. On a successful save, the target takes half as much damage."] }], "reaction": [{ "name": "War Caster", "entries": ["When a creature's provokes an opportunity attack, Veldarin can cast a spell at the creature, rather than making an opportunity attack."] }, { "name": "Illusory Self (Recharges after a Short or Long Rest)", "entries": ["When a creature makes an attack roll against Veldarin they can create an illusory duplicate of themselves causing that attack to miss."] }], "legendaryHeader": ["The Archmage of Alyentlea can take 5 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. Veldarin regains spent legendary actions at the start of its turn."], "legendary": [{ "name": "Mental Stunting", "entries": ["Veldarin uses his {@b {@i Mental Stunting}}."] }, { "name": "Teleport", "entries": ["Asmodeus uses his Teleport action."] }, { "name": "Manipulate Intrigue", "entries": ["Veldarin targets one creature that is his nature he can see within 60 feet of him. The target uses its reaction to move up to half its speed and make one weapon attack against a creature of Veldarin choice that he can see."] }, { "name": "Shadow Gauntlets (Costs 2 Actions)", "entries": ["Veldarin attacks with his {@b {@i Shadow Gauntlets}}."] }, { "name": "Cast a Spell (Costs 1-5 Actions)", "entries": ["Veldarin expends a spell slot to cast a 1st-, 2nd-, 3rd-, 4th-, or 5th-level spell that he has prepared. Doing so costs 1 legendary action per level of the spell."] }, { "name": "Summon Night Elf Matron (Costs 4 Actions)", "entries": ["Veldarin magically summons a {@i Matron Mother}. The elf appears in an unoccupied space within 60 feet of Veldarin, acts as Veldarin's ally, and can summon other elves if it has such power. The elf remains until Veldarin dies or until he dismisses it as an action."] }], "traitTags": ["Magic Weapons", "Regeneration"], "actionTags": ["Multiattack"], "source": "MPSource", "page": 1, "legendaryGroup": { "name": "Veldarin", "source": "MPSource" } }], "legendaryGroup": [{ "name": "Veldarin", "source": "MPSource", "regionalEffects": ["The region containing [MON]'s lair is warped by her magic, which creates one or more of the following effects:", { "type": "list", "items": ["Shadows come to life within 6 miles of the Archmage of Alyentlea's lair. Most of the time these living shadows are unnerving and nothing more, but when a creature acts against the interests of Veldarin, the shadows can interfere and cause any relevant die roll to be made with disadvantage.", "Magic saturates the area within 6 miles of the lair, causing minor random effects similar to a prestidigitation cantrip.", "Veldarin can cast their senses to any area containing darkness, dim light, or shadows within 6 miles of their lair, similar to a clairvoyance spell."] }, "If [MON] dies, the first two effects fade over the course of 2d10 days."], "lairActions": ["When fighting inside its lair, [MON] can invoke the ambient magic to take lair actions. On initiative count 20 (losing initiative ties), [MON] can take one lair action to cause one of the following effects:", { "type": "list", "items": ["Veldarin wills darkness to overpower the light. All bright light sources in the lair shed only dim light to their normal bright light radius, and dim light sources are extinguished. This lasts until Veldarin dismisses the effect or dies.", "An opaque wall of writhing shadows springs up from a solid surface within 120 feet of Veldarin. The wall is up to 60 feet long, 10 feet high, and 5 feet thick. Each creature in the area must make a successful {@dc 15} Dexterity saving throw or take 18 ({@damage 4d8}) necrotic damage. Creatures in the wall's space are pushed 5 feet out of the wall's space, appearing on whichever side of the wall they choose. A creature can move through the wall, but the semimaterial shadow resists intrusion. For every foot a creature travels through the wall, it must spend 4 feet of movement. Furthermore, any creature that, during its own turn, occupies any part of the wall's space takes 18 ({@damage 4d8}) necrotic damage, or half damage with a successful {@dc 15} Constitution saving throw. Each 10-foot section of wall has AC 5, 15 hit points, vulnerability to radiant damage, resistance to bludgeoning and piercing damage, and immunity to cold, poison, and psychic damage. The wall lasts until Veldarin uses this lair action again, or until she dies.", "Veldarin targets one creature within 60 feet of her and assails its mind with visions of hopelessness and despair. The creature must succeed on a {@dc 15} Wisdom saving throw or be {@condition stunned} until initiative count 20 on the next round."] }] }] }