{
    "_meta": {
        "sources": [
            {
                "json": "WOR",
                "abbreviation": "WOR",
                "full": "Test Auto Souce - Boblinius",
                "authors": [
                    "Me"
                ],
                "version": "1.0.0",
                "url": "https://www.youtube.com/watch?v=dQw4w9WgXcQ&ab_channel=RickAstley",
                "color": "c2b280"
            }
        ],
        "dateAdded": 1620498967,
        "dateLastModified": 1620498967,
        "tested": true
    },
    "monster": [
        {
            "name": "Boblin, The Efficient Goblin King",
            "type": {
                "type": "Humanoid, Aberration, Fiend",
                "tags": [
                    "goblinoid"
                ]
            },
            "alignment": [
                "L",
                "E"
            ],
            "size": "S",
            "cha": 18,
            "wis": 14,
            "int": 12,
            "con": 24,
            "str": 18,
            "dex": 18,
            "hp": {
                "formula": "25d6 + 175",
                "average": 250.0
            },
            "ac": [
                {
                    "ac": 19,
                    "from": [
                        "natural armor"
                    ]
                }
            ],
            "speed": {
                "walk": 30
            },
            "cr": "20",
            "save": {
                "dex": "+10",
                "con": "+13",
                "cha": "+10"
            },
            "skill": {
                "acrobatics": "+10",
                "arcana": "+7",
                "athletics": "+10",
                "insight": "+14",
                "intimidation": "+10",
                "persuasion": "+10",
                "sleight of Hand": "+10",
                "stealth": "+16",
                "survival": "+8"
            },
            "passive": 12,
            "resist": [
                "psychic"
            ],
            "conditionImmune": [
                "charmed",
                "frightened",
                "poisoned"
            ],
            "languages": [
                "Common",
                "Deep Speech",
                "Dwarvish",
                "Elvish",
                "Giant",
                "Goblin",
                "Orc"
            ],
            "senses": [
                "darkvision 60ft.",
                "truesight 60ft."
            ],
            "trait": [
                {
                    "name": "Amorphous",
                    "entries": [
                        "Boblin can move through a space as narrow as 1 inch without squeezing."
                    ]
                },
                {
                    "name": "Spider Climb",
                    "entries": [
                        "Boblin can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
                    ]
                },
                {
                    "name": "Boblin's Scepter",
                    "entries": [
                        "Boblin carries an opulent emerald scepter. He can use it to cast major illusion."
                    ]
                },
                {
                    "name": "Magic Resistance",
                    "entries": [
                        "Boblin has advantage on saving throws against spells and other magical effects."
                    ]
                },
                {
                    "name": "Legendary Resistance (2/Day)",
                    "entries": [
                        "If Boblin fails a saving throw, he can choose to succeed instead."
                    ]
                },
                {
                    "name": "Slacker Sense",
                    "entries": [
                        "Boblin is aware of creatures within 5 miles of it that have an Intelligence score of 4 or higher. It knows the distance and direction to each creature, as well as each one's Intelligence score, but can't sense anything else about it. A creature protected by a mind blank spell, a nondetection spell, or similar magic can't be perceived in this manner."
                    ]
                },
                {
                    "name": "Regeneration",
                    "entries": [
                        "Boblin regains 15 hit points at the start of its turn. If he takes acid or fire damage, this trait doesn't function at the start of his next turn. Boblin dies only if he starts his turn with 0 hit points and doesn't regenerate."
                    ]
                },
                {
                    "name": "Empathy For The King",
                    "entries": [
                        "If Boblin takes psychic damage, each creature within 20 feet of him takes that damage as well."
                    ]
                }
            ],
            "spellcasting": [
                {
                    "name": "Innate Spellcasting (Psionics)",
                    "headerEntries": [
                        "Boblin's' innate spellcasting ability is Intelligence (spell save {@dc 15}, {@hit 7} to hit with spell attacks). He can innately cast the following spells, requiring no components:"
                    ],
                    "ability": "int",
                    "will": [
                        "{@spell guidance}",
                        "{@spell mage hand}",
                        "{@spell vicious mockery}",
                        "{@spell true strike}",
                        "{@spell detect thoughts}",
                        "{@spell levitate}"
                    ],
                    "daily": {
                        "1e": [
                            "{@spell dominate monster}",
                            "{@spell plane shift} (self only)"
                        ]
                    }
                },
                {
                    "name": "Spellcasting",
                    "spells": {
                        "1": {
                            "spells": [
                                "{@spell charm person}",
                                "{@spell command}",
                                "{@spell comprehend languages}",
                                "{@spell sanctuary}"
                            ],
                            "slots": 4
                        },
                        "2": {
                            "spells": [
                                "{@spell crown of madness}",
                                "{@spell phantasmal force}",
                                "{@spell see invisibility}"
                            ],
                            "slots": 3
                        },
                        "3": {
                            "spells": [
                                "{@spell clairvoyance}",
                                "{@spell fear}",
                                "{@spell meld into stone}"
                            ],
                            "slots": 3
                        },
                        "4": {
                            "spells": [
                                "{@spell confusion}",
                                "{@spell stone shape}"
                            ],
                            "slots": 3
                        },
                        "5": {
                            "spells": [
                                "{@spell scrying}",
                                "{@spell telekinesis}"
                            ],
                            "slots": 2
                        }
                    },
                    "headerEntries": [
                        "Boblin is a 10th-level spellcaster. Its spellcasting ability is Intelligence (spell save {@dc 15}, {@hit 7} to hit with spell attacks). Boblin has the following spells prepared:"
                    ]
                }
            ],
            "spellcastingTags": [
                "P"
            ],
            "action": [
                {
                    "name": "Multiattack",
                    "entries": [
                        "Boblin makes four attacks with his tentacles or two attacks with his fleshbow. Up to two tentacle attacks can be replaced by Employee Burnout. Boblin has an endless number of tentacles."
                    ]
                },
                {
                    "name": "Human Resources",
                    "entries": [
                        "{@i Melee Weapon Attack}: 10 to hit, reach 15 ft., one target. Hit: 17 ({@damage 3d8 + 4}) slashing damage. If the target is a Medium or smaller creature, it is {@condition grappled} (escape {@dc 18}), pulled into an unoccupied space within 5 feet of Boblin, and must succeed on a {@dc 15} Wisdom saving throw or be {@condition frightened} until the end of their next turn. A creature cannot be frightened by this feature again for 24 hours. Boblin has unlimited tentacle whips."
                    ]
                },
                {
                    "name": "Fleshbow",
                    "entries": [
                        "{@atk rw} {@hit 10} to hit, range 80/320 ft., one target. {@h}15 ({@damage 2d10 + 4}) piercing damage."
                    ]
                },
                {
                    "name": "Employee Burnout",
                    "entries": [
                        "One creature {@condition grappled} by a tentacle of Boblin's must make a {@dc 17} Constitution saving throw. On a failed save, the target takes 18 ({@damage 4d8}) necrotic damage, and Boblin regains a number of hit points equal to half the necrotic damage taken."
                    ]
                },
                {
                    "name": "Leadership (1/rest)",
                    "entries": [
                        "For 1 minute, Boblin can utter a special command or warning whenever a nonhostile creature that he can see within 30 feet of him makes an attack roll or saving throw. The creature can add d4 to its roll provided it can hear and understand him. A creature can benefit from only one Leadership die at a time. This effect ends if Boblin is {@condition incapacitated}."
                    ]
                },
                {
                    "name": "Managerial Will {@recharge 5}",
                    "entries": [
                        "Boblin magically emits psychic energy in a 60-foot cone. Each creature in that area must succeed on a {@dc 15} Intelligence saving throw or take 22 ({@damage 4d8 + 4}) psychic damage and be {@condition stunned} for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
                    ]
                },
                {
                    "name": "Corporate Slave {@recharge 6}",
                    "entries": [
                        "Boblin targets all creatures of his choice he can see within 60 feet of him. The targets must succeed on a {@dc 18} Constitution saving throw or take 22 ({@damage 4d6 + 8}) necrotic damage and become corrupted for 1 minute. A corrupted creature's flesh twists in alien ways. The creature has disadvantage on attack rolls, its speed is reduced by half, and if it tries to cast a spell, it must first succeed on a {@dc 13} Intelligence check or the spell fails and is wasted. The corrupted creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
                    ]
                },
                {
                    "name": "Productivity Ray",
                    "entries": [
                        "Boblin shoots three of the following rays at random (reroll duplicates), choosing targets it can see within 120 feet of it:",
                        "1. Charm Ray. The targeted creature must succeed on a {@dc 16} Wisdom saving throw or be {@condition charmed} by Boblin for 1 hour, or until Boblin harms the creature.",
                        "2. Paralyzing Ray. The targeted creature must succeed on a {@dc 16} Constitution saving throw or be {@condition paralyzed} for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
                        "3. Fear Ray. The targeted creature must succeed on a {@dc 16} Wisdom saving throw or be {@condition frightened} for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
                        "4. Slowing Ray. The targeted creature must succeed on a {@dc 16} Dexterity saving throw. On a failed save, the target's speed is halved for 1 minute. In addition, the creature can't take reactions, and it can take either an action or a bonus action on its turn, not both. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
                        "5. Enervation Ray. The targeted creature must make a {@dc 16} Constitution saving throw, taking 36 ({@damage 8d8}) necrotic damage on a failed save, or half as much damage on a successful one.",
                        "6. Telekinetic Ray. If the target is a creature, it must succeed on a {@dc 16} Strength saving throw or Boblin moves it up to 30 feet in any direction. It is {@condition restrained} by the ray's telekinetic grip until the start of Boblin's next turn or until Boblin is {@condition incapacitated}. If the target is an object weighing 300 pounds or less that isn't being worn or carried, it is moved up to 30 feet in any direction. Boblin can also exert fine control on objects with this ray, such as manipulating a simple tool or opening a door or a container.",
                        "7. Sleep Ray. The targeted creature must succeed on a {@dc 16} Wisdom saving throw or fall asleep and remain {@condition unconscious} for 1 minute. The target awakens if it takes damage or another creature takes an action to wake it. This ray has no effect on constructs and undead.",
                        "8. Petrification Ray. The targeted creature must make a {@dc 16} Dexterity saving throw. On a failed save, the creature begins to turn to stone and is restrained. It must repeat the saving throw at the end of its next turn. On a success, the effect ends. On a failure, the creature is {@condition petrified} until freed by the greater restoration spell or other magic.",
                        "9. Disintegration Ray. If the target is a creature, it must succeed on a {@dc 16} Dexterity saving throw or take 45 ({@damage 10d8}) force damage. If this damage reduces the creature to 0 hit points, its body becomes a pile of fine gray dust. If the target is a Large or smaller nonmagical object or creation of magical force, it is disintegrated without a saving throw. If the target is a Huge or larger object or creation of magical force, this ray disintegrates a 10-foot cube of it.",
                        "10. Death Ray. The targeted creature must succeed on a {@dc 16} Dexterity saving throw or take 55 ({@damage 10d10}) necrotic damage. The target dies if the ray reduces it to 0 hit points."
                    ]
                }
            ],
            "bonus": [
                {
                    "name": "Nimble Escape",
                    "entries": [
                        "Boblin can take the Disengage or Hide action as a bonus action on each of its turns."
                    ]
                },
                {
                    "name": "Resume Building {@recharge 5}",
                    "entries": [
                        "Boblin dissolves into a shifting mass of flesh, tentacles, eyes, claws, and mouths. Creatures of his choice he can see within 30 feet of himself must make a {@dc 18} Intelligence saving throw, taking 4d8 psychic damage on a failed save, or half as much damage on a successful one. This transformation lasts until the end of Boblin's next turn. While transformed, he has advantage on attack rolls, attack rolls made against him have disadvantage, and he can move through spaces at least 1 inch wide without squeezing."
                    ]
                }
            ],
            "reaction": [
                {
                    "name": "Redirect Attack",
                    "entries": [
                        "When a creature Boblin can see targets him with an attack, he chooses another goblinoid within 30 feet of him. The two goblins swap places, and the chosen goblin becomes the target instead."
                    ]
                }
            ],
            "legendaryHeader": [
                "The goblin can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The goblin regains spent legendary actions at the start of its turn."
            ],
            "legendary": [
                {
                    "name": "Your Talents Are Better Suited for Other Tasks",
                    "entries": [
                        "Boblin targets one creature within 120 feet of him. He breaks the creature's concentration on a spell it has cast. The creature also takes 1d4 psychic damage per level of the spell."
                    ]
                },
                {
                    "name": "An Eye For Productivity",
                    "entries": [
                        "Boblin uses a random eye ray."
                    ]
                },
                {
                    "name": "Managerial Rage",
                    "entries": [
                        "Boblin makes a melee attack and moves up to half his speed without invoking opportunity attacks."
                    ]
                },
                {
                    "name": "Aberrant Cantrip",
                    "entries": [
                        "Boblin casts a cantrip or innate spell."
                    ]
                },
                {
                    "name": "Aberrant Casting (2 actions)",
                    "entries": [
                        "Boblin casts a spell of 1st level or higher."
                    ]
                },
                {
                    "name": "Forced Retirement (3 actions)",
                    "entries": [
                        "Boblin uses Corporate Slave."
                    ]
                }
            ],
            "traitTags": [
                "Amorphous",
                "Spider Climb",
                "Magic Resistance",
                "Regeneration"
            ],
            "actionTags": [
                "Multiattack"
            ],
            "languageTags": [
                "C",
                "DS",
                "D",
                "E",
                "GI",
                "GO",
                "O"
            ],
            "source": "WOR",
            "page": 1,
            "legendaryGroup": {
                "name": "Boblin, The Efficient Goblin King",
                "source": "WOR"
            }
        },
        {
            "name": "Man-Catcher",
            "type": {
                "type": "Humanoid",
                "tags": [
                    "goblin mutant"
                ]
            },
            "alignment": [
                "C",
                "E"
            ],
            "size": "H",
            "cha": 9,
            "wis": 9,
            "int": 7,
            "con": 20,
            "str": 23,
            "dex": 9,
            "hp": {
                "formula": "7d12 + 35",
                "average": 77.0
            },
            "ac": [
                {
                    "ac": 14,
                    "from": [
                        "natural armor"
                    ]
                }
            ],
            "speed": {
                "walk": 40
            },
            "cr": "5",
            "save": {
                "str": "+9",
                "con": "+8",
                "wis": "+2"
            },
            "skill": {
                "athletics": "+9",
                "perception": "+2"
            },
            "passive": 12,
            "languages": [
                "Giant",
                "Goblin"
            ],
            "senses": [
                "darkvision 60ft."
            ],
            "action": [
                {
                    "name": "Man-Catching Chain",
                    "entries": [
                        "{@i Melee Weapon Attack}: 9 to hit, reach 30 ft., one target. Hit: 16 ({@damage 3d6 + 6}) bludgeoning damage. On a hit, the target is {@condition grappled} (escape {@dc 17}, remove {@dc 17} Athletics or Sleight of Hand). Until the grapple ends, the target is {@condition restrained}, and the man-catcher can't use this attack on anything else. The man-catcher can reel in a grappled target 15 feet on its turn as a free action. Also, a grappled target is reeled in 15 feet at the start of its turn."
                    ]
                },
                {
                    "name": "Rock",
                    "entries": [
                        "{@atk rw} {@hit 9} to hit, range 60/240 ft., one target. {@h}16 ({@damage 3d6 + 6}) bludgeoning damage."
                    ]
                }
            ],
            "reaction": [
                {
                    "name": "Furious Defense",
                    "entries": [
                        "After a creature the man-catcher can see is dealt damage by a foe within 30 feet of it, the man-catcher makes a chain attack against that foe."
                    ]
                }
            ],
            "languageTags": [
                "GI",
                "GO"
            ],
            "source": "WOR",
            "page": 1
        }
    ],
    "legendaryGroup": [
        {
            "name": "Boblin, The Efficient Goblin King",
            "source": "WOR",
            "regionalEffects": [
                "The region containing Boblin's lair is warped by his presence, which creates the following effects:",
                {
                    "type": "list",
                    "items": [
                        "If a creature works under the employ of Boblin for at least one workday, that creature must make {@dc 14} Wisdom saving throws every long rest or gain the following flaw: \"I must increase my delivery efficiency at any cost\". If this flaw is gained, the {@dc increases} to 16, and on a failure, the creature gains a mutation of the DM's choice and gains the Aberration creature type. If the creature gains a mutation, the {@dc increases} to 18, and on a failure, the creature is under Boblin's control. The only ways to free the creature are via a {@spell Wish} spell or the death of Boblin. The Demon Core must be destroyed for a creature to return to normal."
                    ]
                },
                "If Boblin dies, the effect fades over the course of 3d6 days."
            ],
            "lairActions": [
                "When fighting inside his lair, Boblin can invoke the ambient magic to take lair actions. On initiative count 20 (losing initiative ties), Boblin can take one lair action to cause one of the following effects:",
                {
                    "type": "list",
                    "items": [
                        "Walls and floors sprout hideous appendages until initiative count 20 on the round after next. Any creature, including one on the Ethereal Plane, that is hostile to Boblin and starts its turn within 10 feet of a wall or a point on the floor of Boblin's choosing must succeed on a {@dc 17} Dexterity saving throw or be {@condition grappled}. Escaping requires a successful {@dc 17} Strength ({@skill Athletics}) or Dexterity ({@skill Acrobatics}) check.",
                        "Boblin's eye pops out of his skull and opens in the air at a point within 50 feet of him. One random eye ray of Boblin's shoots from that eye, which is considered to be an ethereal source, at a target of his choice. The eye then closes and disappears.",
                        "Boblin commands his pet troll amalgate to seep through the floor and attack his enemies. Any creature in a 20-foot radius circle around a point of Boblin's choice within his lair must make a {@dc 16} Dexterity saving throw or be stabbed by the amalgate's wretched flesh blades, which deal 14 ({@damage 4d6}) piercing or half as much on a save."
                    ]
                }
            ]
        }
    ]
}